# DataFrame from Array

In [1]:
import numpy as np
import pandas as pd
InputArray = np.array([[1, 2, 3], [4, 5, 6]])

In [2]:
InputArray

array([[1, 2, 3],
       [4, 5, 6]])

In [3]:
DfFromArray = pd.DataFrame(InputArray)

In [4]:
type(DfFromArray)

pandas.core.frame.DataFrame

In [5]:
DfFromArray

   0  1  2
0  1  2  3
1  4  5  6

# DataFrame From Dictionary

In [9]:
 InputDictn = {'Col1': ['1', '3'], 'Col2': ['1', '2'],
               'Col3': ['2', '4']}

In [10]:
DfFromDictn = pd.DataFrame(InputDictn)

In [11]:
DfFromDictn
# import pandas as pd

  Col1 Col2 Col3
0    1    1    2
1    3    2    4

# DataFrame from list

In [22]:
DfFromList = pd.DataFrame(data=[4,5,6,7],
                          index=range(0,4),
                          columns=['ColA'])

In [24]:
DfFromDF = DfFromDictn[::] # all rows

In [25]:
DfFromDF

  Col1 Col2 Col3
0    1    1    2
1    3    2    4

In [16]:
data=[4,5,6,7]

In [17]:
type(data)

list

In [18]:
data

[4, 5, 6, 7]

# merging dataframes

In [43]:
InputDataDictn1 = {
        'course_id': ['901', '902', '903', '904', '905'],
        'first_name': ['Steven', 'Alex', 'Lee', 'John', 'Greg'], 
        'last_name': ['King', 'Maden', 'Chan', 'Bruce', 'Wargus']}

DFstu1 = pd.DataFrame(InputDataDictn1 ,
    columns = ['course_id', 'first_name', 'last_name'])

DFstu1

  course_id first_name last_name
0       901     Steven      King
1       902       Alex     Maden
2       903        Lee      Chan
3       904       John     Bruce
4       905       Greg    Wargus

In [39]:
InputDataDictn2 = {
        'course_id': ['904', '905', '906', '907', '908'],
        'first_name': ['Tina', 'Trecy', 'Andria', 'Eliza', 'Gracy'], 
        'last_name': ['Smith', 'Muller', 'Morgan', 'Johnson', 'Jordan']}

DFstu2 = pd.DataFrame(InputDataDictn2 ,
    columns = ['course_id', 'first_name', 'last_name'])

DFstu2

  course_id first_name last_name
0       904       Tina     Smith
1       905      Trecy    Muller
2       906     Andria    Morgan
3       907      Eliza   Johnson
4       908      Gracy    Jordan

In [44]:
InputDataDict3 = {'course_id': ['901', '902', 
        '903', '904', '905', '907', '908', '909', 
        '910', '911'],
        'exam_id': [51, 15, 15, 61, 
                    16, 14, 15, 1, 61, 16]}

DFtest = pd.DataFrame(InputDataDict3, 
                columns = ['course_id','exam_id'])
DFtest

  course_id  exam_id
0       901       51
1       902       15
2       903       15
3       904       61
4       905       16
5       907       14
6       908       15
7       909        1
8       910       61
9       911       16

In [45]:
#Join the two dataframes along rows

DFstudent  = pd.concat([DFstu1 , DFstu2 ])

DFstudent

  course_id first_name last_name
0       901     Steven      King
1       902       Alex     Maden
2       903        Lee      Chan
3       904       John     Bruce
4       905       Greg    Wargus
0       904       Tina     Smith
1       905      Trecy    Muller
2       906     Andria    Morgan
3       907      Eliza   Johnson
4       908      Gracy    Jordan

In [48]:
#-------Join the two dataframes along columns-----------------
pd.concat([DFstu1 , DFstu2 ], axis=1)

  course_id first_name last_name course_id first_name last_name
0       901     Steven      King       904       Tina     Smith
1       902       Alex     Maden       905      Trecy    Muller
2       903        Lee      Chan       906     Andria    Morgan
3       904       John     Bruce       907      Eliza   Johnson
4       905       Greg    Wargus       908      Gracy    Jordan

In [50]:
#-----Merge two dataframes along the course_id value-----------------

pd.merge(DFstudent  , DFtest , on='course_id')

  course_id first_name last_name  exam_id
0       901     Steven      King       51
1       902       Alex     Maden       15
2       903        Lee      Chan       15
3       904       John     Bruce       61
4       904       Tina     Smith       61
5       905       Greg    Wargus       16
6       905      Trecy    Muller       16
7       907      Eliza   Johnson       14
8       908      Gracy    Jordan       15

In [52]:
# ----Merge with inner join (only matching rows) ---------------------
pd.merge(DFstu1 , DFstu2, 
         on='course_id', 
         how='inner', 
         suffixes=('_DFstu1','_DFstu2'))

,course_id,first_name_DFstu1,last_name_DFstu1,first_name_DFstu2,last_name_DFstu2
0,904,John,Bruce,Tina,Smith
1,905,Greg,Wargus,Trecy,Muller